OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_eax.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include <stddef.h>
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_error.h"
#include "app_util.h"
#include "nrf_section.h"
#include "nrf_crypto.h"
#include "common_test.h"

/**@brief AES EAX test vectors can be found in the paper: "The EAX Mode of Operation
 * (A Two-Pass Authenticated-Encryption Scheme Optimized for Simplicity and Efficiency)".
 *
 * http://web.cs.ucdavis.edu/~rogaway/papers/eax.pdf
 */

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_EAX)

/*lint -save -e91 */

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_EAX_128)

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_encrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=1 ad_len=0 mac_len=4 nonce_len=1",
    .p_plaintext            = "2a",
    .p_ciphertext           = "17",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "",
    .p_nonce                = "8b",
    .p_mac                  = "4a8d79c5"
};

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_encrypt1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=0 ad_len=20 mac_len=4 nonce_len=1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "38b759a2375e8036502c27b58893eb9b85f47c35",
    .p_nonce                = "8b",
    .p_mac                  = "18786d39"
};

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_encrypt2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=1 ad_len=20 mac_len=4 nonce_len=1",
    .p_plaintext            = "2a",
    .p_ciphertext           = "17",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "38b759a2375e8036502c27b58893eb9b85f47c35",
    .p_nonce                = "8b",
    .p_mac                  = "5b320e1f"
};

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_encrypt3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=255 ad_len=255 mac_len=16 nonce_len=16",
    .p_plaintext            = "7e61def9f2192a90034d6a5cf1045cc374a83e5edca6a3d23b51c7cb13ce4d0a67e08937d368e0ccfc520cbd3977d1f019a37c4fe25a94ed1381f63fcb81ff17e5c2102cbcab4ee088f7da0264d8f500ed1b32103c1cbe7a1ce369f1e265e73d5feadb351179cdfb3d917cddf42bde16bc91c77ff3628d3fc034438e73d8b45a802ff872be9dd555499ba0331b4838d27629a769e36efd873ce0b704c25b927f34f43391c4f58a281be789c1afa78d89d3f5e13d39dad8b6b75f27a4a991043cc86fa2380dad9665e441b62a25822970e1a944e87a948c40579bacf4bc920dd9acee204ef3c9dbe5e09ee9845b2e312880fb949c8289438e0c48bcf28ce87d",
    .p_ciphertext           = "6d7e37a06ea3dbac3910a976fcc8ed09d7f6870b3dcd5ab992c002ff4b5135c2d351878461043abd1cf94fbd2bf342776e3bf2f0808832ac214d23cded3b36dddb9e7622c6756aafbe14d60fcbe9badc8cd3f435c3ea665727b98b8d2a94e94963fc93325a34b96e104fcf4637a44cb324cb7d2f16c62928ab3cb2cda63514cec5dc03f21c774243c2b21d7b047bde39a27c1d8e6712ae2bd08668e6357c072f9fa099647399fad106b1b6899c0c77c36a35be9b9b1318e558a5fa86ae2add1d3f5f34b1bc8d2e33768550c0628f9180a562c8c45846e9bd012ce67ab30a47a8c52749df8a132d0111de1a99b3a8d7f394aa8371c00bb5fc39c1103a3d8959",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "c3a3a82d25b7d6cd060985c09f02b16b10693bb4cc536052a280f0d2a4904d3e95da5a3389f92fd3b8fe20f000b926819b05edfb901f33ed75b8aae146da9f18c90bbaf1845fbb1263d7d89d0f871c899152fb5ef5b51282ba5c4e183e22ad0d416f75cef49e641ff3e5b6de8d18ca0fd9d34a9580f4abdd8b07354c232c4305c7d2bbdedf4f318579c8a76a877961bb8f52b4943351158d062e92d0a9c592f8e3776ffcbf963ec1b0e4ecc0d30a7f8a4b50b42a14d144d8a89706cdb10f7005dfc6915b489f9638e7eed492819447a5ddb321fa4080216a58fdbf8dda968b16fff7353d669aec1eb23105ecec9d511cab89b5ff16fb744b92a44ce19b5bcf",
    .p_nonce                = "82cb43c4e79279a5addc07a5667e751f",
    .p_mac                  = "294df83ae2b1690c93347632fb52034b"
};

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_decrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "EAX 128 Decrypt message_len=1 ad_len=0 mac_len=4 nonce_len=1",
    .p_plaintext            = "2a",
    .p_ciphertext           = "17",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "",
    .p_nonce                = "8b",
    .p_mac                  = "4a8d79c5"
};

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_decrypt1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "EAX 128 Decrypt message_len=0 ad_len=20 mac_len=4 nonce_len=1",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "38b759a2375e8036502c27b58893eb9b85f47c35",
    .p_nonce                = "8b",
    .p_mac                  = "18786d39"
};

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_decrypt2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "EAX 128 Decrypt message_len=1 ad_len=20 mac_len=4 nonce_len=1",
    .p_plaintext            = "2a",
    .p_ciphertext           = "17",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "38b759a2375e8036502c27b58893eb9b85f47c35",
    .p_nonce                = "8b",
    .p_mac                  = "5b320e1f"
};

// AES EAX - 128 bits custom test vector
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_c_decrypt3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name     = "EAX 128 Decrypt message_len=255 ad_len=255 mac_len=16 nonce_len=16",
    .p_plaintext            = "7e61def9f2192a90034d6a5cf1045cc374a83e5edca6a3d23b51c7cb13ce4d0a67e08937d368e0ccfc520cbd3977d1f019a37c4fe25a94ed1381f63fcb81ff17e5c2102cbcab4ee088f7da0264d8f500ed1b32103c1cbe7a1ce369f1e265e73d5feadb351179cdfb3d917cddf42bde16bc91c77ff3628d3fc034438e73d8b45a802ff872be9dd555499ba0331b4838d27629a769e36efd873ce0b704c25b927f34f43391c4f58a281be789c1afa78d89d3f5e13d39dad8b6b75f27a4a991043cc86fa2380dad9665e441b62a25822970e1a944e87a948c40579bacf4bc920dd9acee204ef3c9dbe5e09ee9845b2e312880fb949c8289438e0c48bcf28ce87d",
    .p_ciphertext           = "6d7e37a06ea3dbac3910a976fcc8ed09d7f6870b3dcd5ab992c002ff4b5135c2d351878461043abd1cf94fbd2bf342776e3bf2f0808832ac214d23cded3b36dddb9e7622c6756aafbe14d60fcbe9badc8cd3f435c3ea665727b98b8d2a94e94963fc93325a34b96e104fcf4637a44cb324cb7d2f16c62928ab3cb2cda63514cec5dc03f21c774243c2b21d7b047bde39a27c1d8e6712ae2bd08668e6357c072f9fa099647399fad106b1b6899c0c77c36a35be9b9b1318e558a5fa86ae2add1d3f5f34b1bc8d2e33768550c0628f9180a562c8c45846e9bd012ce67ab30a47a8c52749df8a132d0111de1a99b3a8d7f394aa8371c00bb5fc39c1103a3d8959",
    .p_key                  = "f3ac7f5781e17f46d0d7e48bd8eac9d3",
    .p_ad                   = "c3a3a82d25b7d6cd060985c09f02b16b10693bb4cc536052a280f0d2a4904d3e95da5a3389f92fd3b8fe20f000b926819b05edfb901f33ed75b8aae146da9f18c90bbaf1845fbb1263d7d89d0f871c899152fb5ef5b51282ba5c4e183e22ad0d416f75cef49e641ff3e5b6de8d18ca0fd9d34a9580f4abdd8b07354c232c4305c7d2bbdedf4f318579c8a76a877961bb8f52b4943351158d062e92d0a9c592f8e3776ffcbf963ec1b0e4ecc0d30a7f8a4b50b42a14d144d8a89706cdb10f7005dfc6915b489f9638e7eed492819447a5ddb321fa4080216a58fdbf8dda968b16fff7353d669aec1eb23105ecec9d511cab89b5ff16fb744b92a44ce19b5bcf",
    .p_nonce                = "82cb43c4e79279a5addc07a5667e751f",
    .p_mac                  = "294df83ae2b1690c93347632fb52034b"
};

// AES EAX - The EAX Mode of Operation 128 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt0) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=0 ad_len=8 mac_len=16 nonce_len=16",
    .p_plaintext            = "",
    .p_ciphertext           = "",
    .p_key                  = "233952dee4d5ed5f9b9c6d6ff80ff478",
    .p_ad                   = "6bfb914fd07eae6b",
    .p_nonce                = "62ec67f9c3a4a407fcb2a8c49031a8b3",
    .p_mac                  = "e037830e8389f27b025a2d6527e79d01"
};

