OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aead_eax.c
// AES EAX - The EAX Mode of Operation 128 - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt1) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=2 ad_len=8 mac_len=16 nonce_len=16",
    .p_plaintext            = "f7fb",
    .p_ciphertext           = "19dd",
    .p_key                  = "91945d3f4dcbee0bf45ef52255f095a4",
    .p_ad                   = "fa3bfd4806eb53fa",
    .p_nonce                = "becaf043b0a23d843194ba972c66debd",
    .p_mac                  = "5c4c9331049d0bdab0277408f67967e5"
};

// AES EAX - The EAX Mode of Operation 128 - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt2) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=5 ad_len=8 mac_len=16 nonce_len=16 variant 1",
    .p_plaintext            = "1a47cb4933",
    .p_ciphertext           = "d851d5bae0",
    .p_key                  = "01f74ad64077f2e704c0f60ada3dd523",
    .p_ad                   = "234a3463c1264ac6",
    .p_nonce                = "70c3db4f0d26368400a10ed05d2bff5e",
    .p_mac                  = "3a59f238a23e39199dc9266626c40f80"
};

// AES EAX - The EAX Mode of Operation 128 - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt3) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=5 ad_len=8 mac_len=16 nonce_len=16 variant 2",
    .p_plaintext            = "481c9e39b1",
    .p_ciphertext           = "632a9d131a",
    .p_key                  = "d07cf6cbb7f313bdde66b727afd3c5e8",
    .p_ad                   = "33cce2eabff5a79d",
    .p_nonce                = "8408dfff3c1a2b1292dc199e46b7d617",
    .p_mac                  = "d4c168a4225d8e1ff755939974a7bede"
};

// AES EAX - The EAX Mode of Operation 128 - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt4) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=6 ad_len=8 mac_len=16 nonce_len=16",
    .p_plaintext            = "40d0c07da5e4",
    .p_ciphertext           = "071dfe16c675",
    .p_key                  = "35b6d0580005bbc12b0587124557d2c2",
    .p_ad                   = "aeb96eaebe2970e9",
    .p_nonce                = "fdb6b06676eedc5c61d74276e1f8e816",
    .p_mac                  = "cb0677e536f73afe6a14b74ee49844dd"
};

// AES EAX - The EAX Mode of Operation 128 - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt5) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=12 ad_len=8 mac_len=16 nonce_len=16",
    .p_plaintext            = "4de3b35c3fc039245bd1fb7d",
    .p_ciphertext           = "835bb4f15d743e350e728414",
    .p_key                  = "bd8e6e11475e60b268784c38c62feb22",
    .p_ad                   = "d4482d1ca78dce0f",
    .p_nonce                = "6eac5c93072d8e8513f750935e46da1b",
    .p_mac                  = "abb8644fd6ccb86947c5e10590210a4f"
};

// AES EAX - The EAX Mode of Operation 128 - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt6) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=17 ad_len=8 mac_len=16 nonce_len=16",
    .p_plaintext            = "8b0a79306c9ce7ed99dae4f87f8dd61636",
    .p_ciphertext           = "02083e3979da014812f59f11d52630da30",
    .p_key                  = "7c77d6e813bed5ac98baa417477a2e7d",
    .p_ad                   = "65d2017990d62528",
    .p_nonce                = "1a8c98dcd73d38393b2bf1569deefc19",
    .p_mac                  = "137327d10649b0aa6e1c181db617d7f2"
};

// AES EAX - The EAX Mode of Operation 128 - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aead_simple_data, test_vector_aead_t test_vector_aes_aead_eax_128_encrypt7) =
{
    .p_aead_info            = &g_nrf_crypto_aes_eax_128_info,
    .expected_err_code      = NRF_SUCCESS,
    .crypt_expected_result  = EXPECTED_TO_PASS,
    .mac_expected_result    = EXPECTED_TO_PASS,
    .direction              = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name     = "EAX 128 Encrypt message_len=18 ad_len=8 mac_len=16 nonce_len=16 variant 1",
    .p_plaintext            = "1bda122bce8a8dbaf1877d962b8592dd2d56",
    .p_ciphertext           = "2ec47b2c4954a489afc7ba4897edcdae8cc3",
    .p_key                  = "5fff20cafab119ca2fc73549e20f5b0d",
    .p_ad                   = "54b9f04e6a09189a",
    .p_nonce                = "dde59b97d722156d4d9aff2bc7559826",
    .p_mac                  = "3b60450599bd02c96382902aef7f832a"
};

